app/controllers/api/goals_controller.rb

	def create
		@goal = @user.build_goal(goal_params)
		if @goal.save
---
INSERT INTO "goals" ("user_id", "systolic_bp", "diastolic_bp", "frequency", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["systolic_bp", 120], ["diastolic_bp", 80], ["frequency", "daily"], ["created_at", "2017-12-31 02:54:26.363508"], ["updated_at", "2017-12-31 02:54:26.363508"]]

	def update
		if @goal.update(goal_params)
---
UPDATE "goals" SET "systolic_bp" = ?, "diastolic_bp" = ?, "updated_at" = ? WHERE "goals"."id" = ?  [["systolic_bp", 117], ["diastolic_bp", 70], ["updated_at", "2017-12-31 03:02:31.468567"], ["id", 2]]

	def destroy
		@user.goal.destroy
---
DELETE FROM "goals" WHERE "goals"."id" = ?  [["id", 2]]

	def set_user
		@user = User.find_by(id: params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]