app/controllers/api/users_controller.rb

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("username", "email", "password", "password_confirmation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

	def update
		if @user.update(user_params)
---
UPDATE "users" SET "username" = ?, "email" = ?, "password" = ?, "password_confirmation" = ?, "updated_at" = ? WHERE "users"."id" = ?

	def set_user
		@user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]